---
kind: method
id: M:Autodesk.Revit.DB.OBJExportOptions.IsSurfaceToleranceSet
source: html/566566a9-1846-e1e3-8347-085f45023c6f.htm
---
# Autodesk.Revit.DB.OBJExportOptions.IsSurfaceToleranceSet Method

Checks whether the SurfaceTolerance tessellation parameter is explicitly set.

## Syntax (C#)
```csharp
public bool IsSurfaceToleranceSet()
```

## Returns
True if SurfaceTolerance tessellation parameter is explicitly set, false otherwise.